// [변수 선언과 할당]

// 1. 두 개의 변수 x와 y를 선언하고,
let x, y;

// 2. 각각 숫자 10과 20을 할당하세요.
x = 10;
y = 20;

// 3. 그리고 두 변수를 더한 값을 새로운 변수 sum에 저장하고
let sum = x + y;

// 4. sum의 값을 콘솔에 출력하세요.
console.log('sum의 값을 콘솔에 출력하세요.:', sum);

// [변수 재할당]

// 1. 변수 name에 "Alice"라는 값을 할당하세요.
let name = 'Alice';

// 2. 이후 name 변수에 "Bob"이라는 값으로 재할당하세요.
name = 'Bob';

// 3. name 변수의 최종 값을 콘솔에 출력하세요.
console.log('name 변수의 최종 값을 콘솔에 출력하세요.:', name);

// [상수]

// 1. 상수 PI를 선언하고 값 3.14를 할당하세요.
const PI = 3.14;

// 2. PI 값을 콘솔에 출력하세요.
console.log('PI 값을 콘솔에 출력하세요.:', PI);

// [변수 스왑]

// 1. a와 b라는 두 변수를 선언하고
let a, b;

// 2. 각각 숫자 5와 10을 할당하세요.
a = 5;
b = 10;

// 3. 변수의 값을 서로 교환하여 a에는 10이, b에는 5가 저장되도록 코드를 작성하세요.
const temp = a;
a = b;
b = temp;
console.log('a:', a, ', b:', b);
